Wall Members
The Wall type exposes the following members.
Methods
Name | Description
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from Element.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Properties
Name | Description
CrossSection
 Obtain the Wall Cross-section for this wall.
Width
 Get the overall thickness of the wall.
See Also
Wall Class
Autodesk.Revit.DB Namespace